import PackingCertificates.Algebraic.Generated.ND.RootData

set_option maxRecDepth 1000000
set_option maxHeartbeats 0

namespace PackingCertificates.Algebraic.Generated.ND

def piece_op5 : TemplateData 5 10 where
  rootSpec := nd_root2
  coefficients := ![![[(1 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)]], ![[(-1 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)]], ![[(0 : ℚ), (0 : ℚ)], [(1 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)]], ![[(0 : ℚ), (0 : ℚ)], [(-1 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)]], ![[(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(1 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)]], ![[(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(-1 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)]], ![[(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(1 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)]], ![[(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(-1 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)]], ![[(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(1 : ℚ), (0 : ℚ)]], ![[(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(0 : ℚ), (0 : ℚ)], [(-1 : ℚ), (0 : ℚ)]]]
  normalizerPolynomial := none
  normalizerSqrtInterval := ⟨(1 : ℚ), (1 : ℚ)⟩
  vertexIntervals := ![![⟨(1 : ℚ), (1 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩], ![⟨(-1 : ℚ), (-1 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩], ![⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(1 : ℚ), (1 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩], ![⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(-1 : ℚ), (-1 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩], ![⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(1 : ℚ), (1 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩], ![⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(-1 : ℚ), (-1 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩], ![⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(1 : ℚ), (1 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩], ![⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(-1 : ℚ), (-1 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩], ![⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(1 : ℚ), (1 : ℚ)⟩], ![⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(0 : ℚ), (0 : ℚ)⟩, ⟨(-1 : ℚ), (-1 : ℚ)⟩]]

theorem piece_op5_normalization_checked : piece_op5.normalizationCheck = true := by decide +kernel
theorem piece_op5_vertices_checked : piece_op5.verticesCheck = true := by decide +kernel
theorem piece_op5_centroid_checked : piece_op5.centroidCheck 2 = true := by decide +kernel

end PackingCertificates.Algebraic.Generated.ND
